ciniml/stackchan-idf/recovery/sdkconfig.defaults
# Stack-chan Recovery — 共通 sdkconfig (ESP32-S3)。
# ボード差分 (flash サイズ / board kind) は sdkconfig.defaults.<board> に置く。
CONFIG_IDF_TARGET="esp32s3"

# Recovery は固定領域 (factory) に置く。ロールバックは ADR-001 の bootctl が
# 担うので IDF の otadata ロールバックは使わない。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n

# サイズ最優先。
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# PSRAM は使わない: Quad / Octal がボードで異なり、Recovery を 1 バイナリ
# (flash サイズ違いを除く) に保つため。内部 RAM だけで Wi-Fi + BLE + TLS を
# 動かす構成は atoms3 (slim) プロファイルで実績あり。
CONFIG_SPIRAM=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth (NimBLE) ------------------------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=8192
# OTA チャンク (508 B 暗号化) を 1 ATT write に収める。Main と同じ。
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=6
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=12
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=0
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=400
# 不要なロール / 機能を落とす。
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n

# --- Wi-Fi / lwIP (no-PSRAM 構成、atoms3 slim と同じ値) ----------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_AMSDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_LWIP_TCP_WND_DEFAULT=5760
# Recovery は STA + HTTP + HTTPS クライアントだけ。
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_LWIP_IPV6=n

# --- TLS (GitHub Pages からの release-fetch) ---------------------------------
# 受信レコード 16 KiB は Main と同じ理由 (Fastly が 16 KiB レコードを送る)。
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# CA バンドルは「よく使う CA」の縮小版。フル (~64 KiB 増) は不要。
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# BLE セッション暗号 (X25519 + HKDF + AES-GCM) — crypto.cpp が必要とする。
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_HARDWARE_AES=y

# --- HTTP server -------------------------------------------------------------
# Chrome のヘッダは 1 KiB を超える (Main と同じ)。
CONFIG_HTTPD_MAX_REQ_HDR_LEN=4096
CONFIG_HTTPD_MAX_URI_LEN=128
